src/cf/Catalogs/пбп_ТипыИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>пбп_ТипыИнтеграций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыНастроекИнтеграций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_ТипыИнтеграций/Ext/ManagerModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить предопределенный элемент наследования настроек типа интеграции
//  Определяет родителя (предопределенный элемент второго уровня) типа интеграции, для определения настроек
//
// Параметры:
//  ТипИнтеграции - СправочникСсылка.пбп_ТипыИнтеграций - элемент, для которого нужно узнать родителя
// 
// Возвращаемое значение:
//   - СправочникСсылка.пбп_ТипыИнтеграций - предопределенный элемент второго уровня иерархии
//
Функция ПолучитьПредопределенныйЭлементНаследованияНастроекТипаИнтеграции(ТипИнтеграции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТипИнтеграции);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.Каталог))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.Каталог)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.FTPРесурсы))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.FTPРесурсы)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.ПочтовыйКлиент))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.ПочтовыйКлиент)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.COM))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.COM)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.RESTAPI))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.RESTAPI)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.SOAP))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.SOAP)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.ВнешняяКомпонента))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.ВнешняяКомпонента)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.КоманднаяСтрока))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.КоманднаяСтрока)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.БрокерыСообщений))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.БрокерыСообщений)
	|		КОГДА &Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.ПрямоеПодключениеКБД))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.пбп_ТипыИнтеграций.ПрямоеПодключениеКБД)
	|	КОНЕЦ КАК ПараметрыОт
	|ИЗ
	|	Справочник.пбп_ТипыИнтеграций КАК пбп_ТипыИнтеграций";
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	ПараметрыОт = Справочники.пбп_ТипыИнтеграций.ПустаяСсылка();
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		ПараметрыОт = ВыборкаРезультатаЗапроса.ПараметрыОт;
	КонецЕсли;
	
	Возврат ПараметрыОт;
	
КонецФункции

// Формирует список возможных типов конфигурации.
//
// Параметры:
//  СписокДобавленныхТипов - СписокЗначений - список типов, добавленных "вручную".
//
// Возвращаемое значение:
//  СписокЗначений
//
Функция СформироватьСписокТипов(СписокДобавленныхТипов = Неопределено) Экспорт
	
	СписокТипов = Новый СписокЗначений;
	
	Если СписокДобавленныхТипов <> Неопределено Тогда
		СписокТипов.ЗагрузитьЗначения(СписокДобавленныхТипов.ВыгрузитьЗначения());
	КонецЕсли;
	
	СписокТипов.Добавить("Число", НСтр("ru = 'Число'"));
	СписокТипов.Добавить("Строка", НСтр("ru = 'Строка'"));
	СписокТипов.Добавить("Дата", НСтр("ru = 'Дата'"));
	СписокТипов.Добавить("Булево", НСтр("ru = 'Булево'"));
	
	СписокДобавленныхТипов = СписокТипов.Скопировать();
	
	Возврат СписокТипов;
	
КонецФункции

// Заполняет/обновляет дополнительные параметры настроек интеграций.
//
Процедура ЗаполнитьОбновитьДополнительныеПараметрыНастроекИнтеграций() Экспорт
	
	Таблица = ТаблицаДополнительныхПараметров();
	ПредопределенныеЗначенияДополнительныхПараметров(Таблица);
	Таблица = ОтфильтроватьТаблицу(Таблица);
	
	Элементы = Новый Соответствие;
	Для Каждого Стр Из Таблица Цикл
		Если Элементы[Стр.Элемент] = Неопределено Тогда
			Элементы.Вставить(Стр.Элемент, Новый Массив);
		КонецЕсли;
		Элементы[Стр.Элемент].Добавить(Стр);
	КонецЦикла;
	
	Для Каждого Пара Из Элементы Цикл
		Строки = Элементы[Пара.Ключ];
		
		ТипИнтеграции = Пара.Ключ.ПолучитьОбъект();
		Для Каждого Стр Из Строки Цикл
			НоваяСтрока = ТипИнтеграции.ДополнительныеПараметрыНастроекИнтеграций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
		
		Попытка
			ТипИнтеграции.Записать();
		Исключение
			пбп_Переадресация.ДобавитьСообщениеДляЖурналаРегистрации(
				НСтр("ru = 'Типы интеграций'", пбп_Переадресация.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка, , ,
					пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не удалось записать тип интеграции ''%1'' по причине:
							|%2'"),
						Пара.Ключ,
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПредопределенныеЗначенияДополнительныхПараметров(Таблица)
	
	// Добавление
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Элемент = Справочники.пбп_ТипыИнтеграций.RabbitMq;
	НоваяНастройка.Идентификатор = "ВиртуальныйХост";
	НоваяНастройка.Синоним = НСтр("ru = 'Виртуальный хост'");
	НоваяНастройка.Тип = "Строка";
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Элемент = Справочники.пбп_ТипыИнтеграций.RabbitMq;
	НоваяНастройка.Идентификатор = "ЧастотаПульса";
	НоваяНастройка.Синоним = НСтр("ru = 'Частота пульса'");
	НоваяНастройка.Тип = "Число";
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Элемент = Справочники.пбп_ТипыИнтеграций.RabbitMq;
	НоваяНастройка.Идентификатор = "ИспользоватьTLS";
	НоваяНастройка.Синоним = НСтр("ru = 'Использовать TLS'");
	НоваяНастройка.Тип = "Булево";
	
	НоваяНастройка = Таблица.Добавить();
	НоваяНастройка.Элемент = Справочники.пбп_ТипыИнтеграций.RabbitMq;
	НоваяНастройка.Идентификатор = "Таймаут";
	НоваяНастройка.Синоним = НСтр("ru = 'Таймаут'");
	НоваяНастройка.Тип = "Число";
	// КонецДобавления
	
КонецПроцедуры

Функция ТаблицаДополнительныхПараметров()
	
	ОбщийКвалификатор = Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная);
	КвалификаторТипа = Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Элемент", Новый ОписаниеТипов("СправочникСсылка.пбп_ТипыИнтеграций"));
	Таблица.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка", , , , ОбщийКвалификатор));
	Таблица.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка", , , , ОбщийКвалификатор));
	Таблица.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка", , , , КвалификаторТипа));
	
	Возврат Таблица;
	
КонецФункции

Функция ОтфильтроватьТаблицу(Знач Таблица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПредопределенных.Идентификатор КАК Идентификатор,
	|	ТаблицаПредопределенных.Синоним КАК Синоним,
	|	ТаблицаПредопределенных.Тип КАК Тип,
	|	ТаблицаПредопределенных.Элемент КАК Элемент
	|ПОМЕСТИТЬ ТаблицаПредопределенных
	|ИЗ
	|	&ТаблицаПредопределенных КАК ТаблицаПредопределенных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПредопределенных.Идентификатор КАК Идентификатор,
	|	ТаблицаПредопределенных.Синоним КАК Синоним,
	|	ТаблицаПредопределенных.Тип КАК Тип,
	|	ТаблицаПредопределенных.Элемент КАК Элемент
	|ИЗ
	|	ТаблицаПредопределенных КАК ТаблицаПредопределенных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.пбп_ТипыИнтеграций.ДополнительныеПараметрыНастроекИнтеграций КАК ДополнительныеПараметрыНастроекИнтеграций
	|		ПО ТаблицаПредопределенных.Элемент = ДополнительныеПараметрыНастроекИнтеграций.Ссылка
	|			И ТаблицаПредопределенных.Идентификатор = ДополнительныеПараметрыНастроекИнтеграций.Идентификатор
	|			И ТаблицаПредопределенных.Синоним = ДополнительныеПараметрыНастроекИнтеграций.Синоним
	|			И ТаблицаПредопределенных.Тип = ДополнительныеПараметрыНастроекИнтеграций.Тип
	|ГДЕ
	|	ДополнительныеПараметрыНастроекИнтеграций.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаПредопределенных", Таблица);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
